Repository: xguilxr/WEBAPP
Catalog: Bat.PortalDeCargas.Resource/Resources/Translation/TemplateTranslation.*.resx
Languages: pt_br

# TemplateFileFormatMustBeFilled
source: The file type is inválid
pt_br: O tipo de arquivo informado é inválido

source: Template name must be unique
pt_br: O nome do template deve ser unico

# TemplateNameMustBeFilled
source: Template name is required
pt_br: O nome do template é obrigatório

# TemplateBlobUrlMustBeValidUrl
source: Blob address must be a valid URL
pt_br: O endereço do blob deve ser uma URL válida

# TemplateDescriptionMustBeFilled
source: Template description is required
pt_br: A descrição do template é obrigatória

# TemplateEndUploadWindowInvalid
source: Invalid update window
pt_br: Janela de atualização inválida

# TemplateNotificationEmailInvalid
source: Notification email is invalid
pt_br: O email de notificação não é válido

# TemplateNotificationTextMustBeFilled
source: Notification messsage is required
pt_br: A mensagem de notificação é obrigatória

# TemplatePeriodicityInvalid
source: The periodicity is invalid
pt_br: A periodicidade informada não é válida

# TemplateDimensionOrderGap
source: Must not have gaps in the column order
pt_br: Não podem haver furos na ordem das colunas

# GetFilteredError
source: An error has ocurred obtaining the templates
pt_br: Ocorreu um erro ao obter os templates

# GetTemplateByIdError
source: An error has ocurred obtaining the template
pt_br: Ocorreu um erro ao obter o template

# PostError
source: An error has ocurred while saving the template
pt_br: Ocorreu um erro salvando o tem plate

# DeleteError
source: An error has ocurred deleting the template
pt_br: Ocorreu um erro removendo o template

# InvalidFileFormat
source: The provided file is not in the expected format
pt_br: O arquivo informado não está no formato esperado

# ValidationResut
source: Validation result
pt_br: Resultado da validação

# EmptyFile
source: The file is empty
pt_br: O arquivo está vazio
